000001 IDENTIFICATION DIVISION.
000002    PROGRAM-ID. COMOVAI.
000003    AUTHOR. LUCASC.
000004    DATE-WRITTEN. 2026-04-23.
000005    
000006 ENVIRONMENT DIVISION.
000007    
000008 DATA DIVISION.
000009 WORKING-STORAGE SECTION.
000010 01 NOME PIC A(020). 
000011 01 DATA-ATUAL.
000012           05 ANO-ATUAL PIC 9(004).
000013           05 MES-ATUAL PIC 9(002).
000014           05 DIA-ATUAL PIC 9(002).
000015           
000016 PROCEDURE DIVISION.        
000017     DISPLAY "Entre com seu nome: ".
000018     ACCEPT NOME.
000019     ACCEPT DATA-ATUAL FROM DATE YYYYMMDD.
000020     DISPLAY "Bem Vindo, " NOME.
000021     DISPLAY "sabia que hoje é " DIA-ATUAL "/" MES-ATUAL "/" 
000022      ANO-ATUAL.
000023     
000024
000025     STOP RUN.
000026
000027 END PROGRAM COMOVAI.







