000001 IDENTIFICATION DIVISION.
000002    PROGRAM-ID. HELLOWORLD.
000003    AUTHOR. LUCASC.
000004    DATE-WRITTEN. 2026-04-23.
000005    
000006 ENVIRONMENT DIVISION.
000007    
000008 DATA DIVISION.
000009
000010 PROCEDURE DIVISION.        
000011     DISPLAY "hello, world!".
000012     STOP RUN.
000013
000014 END PROGRAM HELLOWORLD.

