000001 IDENTIFICATION DIVISION.
000002    PROGRAM-ID. IMC.
000003    AUTHOR. LUCASC.
000004    DATE-WRITTEN. 2026-04-23.
000005    
000006 ENVIRONMENT DIVISION.
000007    
000008 DATA DIVISION.
000009 WORKING-STORAGE SECTION.    
000010     
000011 01 NOME PIC A(25).
000012 01 ALTURA PIC 9V99.
000013 01 PESO PIC 999.
000014 01 IMC-TOTAL PIC ZZ9.99.
000015     
000016 PROCEDURE DIVISION.  
000017
000018     DISPLAY "Entre com seu nome: ".
000019     ACCEPT NOME.
000020     DISPLAY "Entre com sua altura (em Mt): ".
000021     ACCEPT ALTURA.
000022     DISPLAY "Entre com seu peso (em Kg): ".
000023     ACCEPT PESO.
000024     COMPUTE IMC-TOTAL = PESO / (ALTURA * ALTURA).
000024     DISPLAY NOME"," "O seu IMC é: " IMC-TOTAL.       
000025     
000026     STOP RUN.
000027 
000028 END PROGRAM IMC.



